In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('data_set.csv')
df

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
...,...,...,...,...,...,...,...
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [8]:
df.head()

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [9]:
df.tail()

,Name,Age,Gender,Email,Join_Date,Salary,Department
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [10]:
df.describe()

         Name Age Gender              Email   Join_Date Salary   Department
count     105  72     89                 95          70     78           89
unique     10   5      5                 90           4      5            5
top     Alice  40   Male  user0@example.com  2021-05-21  50000  Engineering
freq       11  22     22                  2          26     22           26

In [13]:
#converted the column to numeric
df['Age'] = pd.to_numeric(df['Age'], errors = 'coerce')
df.head()

      Name   Age Gender              Email     Join_Date Salary   Department
0    Alice   NaN    NaN  user0@example.com    2021-05-21    NaN        Admin
1      Bob  40.0      M  user1@example.com           NaN  50000  Engineering
2  Charlie   NaN   Male  user2@example.com    2020/01/01  50000           HR
3    David   NaN    NaN  user3@example.com    2021-05-21  70000        Admin
4      Eva  35.0  Other  user4@example.com  July 4, 2020  70000  Engineering

In [14]:
#checked unique values
df['Gender'].unique()

array([nan, 'M', 'Male', 'Other', 'Female', 'F'], dtype=object)

In [15]:
#convert to standard form
df['Gender'] = df['Gender'].replace({'M':'Male',
                                      'F': 'Female'})
df

        Name   Age Gender              Email     Join_Date Salary   Department
0      Alice   NaN    NaN  user0@example.com    2021-05-21    NaN        Admin
1        Bob  40.0   Male  user1@example.com           NaN  50000  Engineering
2    Charlie   NaN   Male  user2@example.com    2020/01/01  50000           HR
3      David   NaN    NaN  user3@example.com    2021-05-21  70000        Admin
4        Eva  35.0  Other  user4@example.com  July 4, 2020  70000  Engineering
..       ...   ...    ...                ...           ...    ...          ...
100    Alice   NaN    NaN  user0@example.com    2021-05-21    NaN        Admin
101      Bob  40.0   Male  user1@example.com           NaN  50000  Engineering
102  Charlie   NaN   Male  user2@example.com    2020/01/01  50000           HR
103    David   NaN    NaN  user3@example.com    2021-05-21  70000        Admin
104      Eva  35.0  Other  user4@example.com  July 4, 2020  70000  Engineering

[105 rows x 7 columns]

In [18]:
# convert date column to date format
df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors = 'coerce')

In [19]:
#convert salary column to numeric 
df['Salary'] = pd.to_numeric(df['Salary'], errors = 'coerce')
df['Salary'].head()

0        NaN
1    50000.0
2    50000.0
3    70000.0
4    70000.0
Name: Salary, dtype: float64

In [20]:
#to check null or missing values
df.isnull().sum()

Name           0
Age           46
Gender        16
Email         10
Join_Date     79
Salary        41
Department    16
dtype: int64

In [21]:
#to fill values
df['Age'].fillna(df['Age'].median(), inplace = True)
df['Age'].head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_3464\1412781466.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace = True)

0    35.0
1    40.0
2    35.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [22]:
#filled null or blank values by Unknown keyword
df['Gender'].fillna ('Unknown' ,  inplace = True)
df['Gender'].head(10)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3464\3247606323.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Gender'].fillna ('Unknown' ,  inplace = True)

0    Unknown
1       Male
2       Male
3    Unknown
4      Other
5      Other
6     Female
7      Other
8     Female
9       Male
Name: Gender, dtype: object

In [23]:
#to fill values
df['Salary'].fillna(df['Salary'].mean(), inplace = True)
df['Salary'].head(10)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3464\1059264496.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace = True)

0    64687.5
1    50000.0
2    50000.0
3    70000.0
4    70000.0
5    70000.0
6    80000.0
7    64687.5
8    50000.0
9    80000.0
Name: Salary, dtype: float64

In [24]:
#filled null or blank values by Unknown keyword
df['Department'].fillna ('Unknown' ,  inplace = True)
df['Department'].head(20)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3464\683524575.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Department'].fillna ('Unknown' ,  inplace = True)

0           Admin
1     Engineering
2              HR
3           Admin
4     Engineering
5           Admin
6     Engineering
7              HR
8     Engineering
9     Engineering
10    Engineering
11          Sales
12          Sales
13          Sales
14             HR
15          Admin
16        Unknown
17    Engineering
18    Engineering
19             HR
Name: Department, dtype: object

In [25]:
#filled null or blank values by specific email
df['Email'].fillna ('iGAP@1234' ,  inplace = True)
df['Email'].tail(20)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3464\1181334648.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Email'].fillna ('iGAP@1234' ,  inplace = True)

85     user85@example.com
86     user86@example.com
87     user87@example.com
88     user88@example.com
89     user89@example.com
90              iGAP@1234
91              iGAP@1234
92              iGAP@1234
93              iGAP@1234
94              iGAP@1234
95              iGAP@1234
96              iGAP@1234
97              iGAP@1234
98              iGAP@1234
99              iGAP@1234
100     user0@example.com
101     user1@example.com
102     user2@example.com
103     user3@example.com
104     user4@example.com
Name: Email, dtype: object

In [26]:
#checked duplicate values
df.duplicated().unique()

array([False,  True])

In [27]:
#drop duplicate values
df.drop_duplicates(inplace = True)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      100 non-null    object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      100 non-null    float64
 6   Department  100 non-null    object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 6.2+ KB

In [29]:
df.to_csv('Cleaned_dataset.csv')